EditorConfig.EditorConfig
GrapeCity.gc-excelviewer
ms-azuretools.vscode-docker
alefragnani.project-manager
bungcip.better-toml
codezombiech.gitignore
dbaeumer.vscode-eslint
deerawan.vscode-faker
eamodio.gitlens
eg2.tslint
esbenp.prettier-vscode
ionutvmi.reg
mikestead.dotenv
ms-python.python
ms-vsliveshare.vsliveshare
rust-lang.rust
vscodevim.vim
zhuangtongfa.Material-theme
