EditorConfig.EditorConfig
GitHub.copilot
GitHub.copilot-chat
GrapeCity.gc-excelviewer
Prisma.prisma
alefragnani.project-manager
astro-build.astro-vscode
asvetliakov.vscode-neovim
bradymholt.pgformatter
codezombiech.gitignore
coolbear.systemd-unit-file
dbaeumer.vscode-eslint
deerawan.vscode-faker
eamodio.gitlens
esbenp.prettier-vscode
hashicorp.terraform
ionutvmi.reg
jdinhlife.gruvbox
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-vsliveshare.vsliveshare
rust-lang.rust-analyzer
tamasfe.even-better-toml
