# https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

# languages
brew "python"
brew "ruby"
brew "rustup"

# tools
tap "getantibody/tap"
brew "getantibody/tap/antibody"
brew "asdf"
brew "awscli"
brew "bash"
brew "bat"
brew "borgbackup"
brew "chamber"
# For YouCompleteMe
brew "cmake"
brew "ctop"
brew "exa"
brew "exiftool"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glances"
brew "gpg"
brew "htop"
brew "hyperfine"
brew "jq"
brew "mosh", args: ['HEAD']
brew "neofetch"
brew "nmap"
brew "oath-toolkit"
brew "pandoc"
# for entering a GPG passphrase
brew "pinentry-mac"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "scrcpy"
brew "tldr"
brew "tmux"
brew "tokei"
brew "xsv"
brew "vim"
brew "yarn"
brew "ykman"
brew "zsh"

# applications
cask "1password"
cask "alfred"
# For scrcpy
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "aws-vault"
cask "aws-vpn-client"
cask "bitwarden"
cask "blackhole"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "epoccam"
tap "homebrew/cask-fonts"
# The Source Code Pro font is apparently in a SVN repo?
brew "svn"
cask "font-source-code-pro"
tap "homebrew/cask-versions"
cask "firefox-developer-edition"
cask "google-drive"
cask "google-chrome"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "homebrew/cask-drivers/logitech-camera-settings"
cask "homebrew/cask-drivers/logitech-gaming-software"
cask "notion"
cask "ngrok"
cask "obs"
cask "omnidisksweeper"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "toggl-track"
mas 'Todoist', id: 585829637
cask "homebrew/cask-drivers/uhk-agent"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
