# https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"
tap "getantibody/tap"
tap "homebrew/cask-drivers"

# languages
brew "node"
# python refers to python 3
# https://docs.brew.sh/Homebrew-and-Python
brew "python"
brew "python@2"
brew "ruby"
brew "rustup"

# tools
brew "getantibody/tap/antibody"
brew "awscli"
brew "bash"
brew "bat"
brew "chamber"
# For YouCompleteMe
brew "cmake"
brew "ctop"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "glances"
brew "gpg"
brew "htop"
brew "jq"
brew "md5sha1sum"
brew "mosh", args: ['HEAD']
brew "neofetch"
brew "oath-toolkit"
brew "pandoc"
# for entering a GPG passphrase
brew "pinentry-mac"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tokei"
brew "xsv"
brew "vim"
brew "yarn"
brew "ykman"
brew "zsh"

# applications
cask "alfred"
cask "android-studio"
cask "anki"
cask "aws-vault"
cask "bitwarden"
cask "borgbackup"
cask "docker"
cask "dropbox"
cask "duet"
cask "font-source-code-pro"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "kap"
cask "keybase"
cask "logitech-gaming-software"
cask "notion"
cask "ngrok"
cask "obs"
cask "osxfuse"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tableplus"
mas 'Todoist', id: 585829637
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
