# https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

# languages
brew "python"
brew "ruby"
brew "rustup-init"

# tools
brew "antidote"
brew "asdf"
brew "awscli"
brew "bash"
brew "bat"
brew "borgbackup"
tap "cloudflare/cloudflare"
brew "cloudflare/cloudflare/cloudflared"
brew "ctop"
tap "MisterTea/et"
brew "MisterTea/et/et"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glances"
brew "gpg"
brew "htop"
brew "hyperfine"
brew "jq"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "oath-toolkit"
brew "pandoc"
# for entering a GPG passphrase
brew "pinentry-mac"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "scrcpy"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "xsv"
brew "vim"
brew "yarn"
brew "ykman"
brew "zsh"

# applications
cask "1password"
# For scrcpy
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "bartender"
cask "blackhole-2ch"
cask "devutils"
cask "discord"
cask "docker"
cask "duet"
cask "elgato-control-center"
tap "homebrew/cask-versions"
cask "firefox@developer-edition"
tap "homebrew/cask-fonts"
cask "font-source-code-pro"
cask "google-drive"
cask "google-chrome"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "logitech-camera-settings"
cask "notion"
cask "ngrok"
cask "obs"
cask "omnidisksweeper"
cask "postman"
cask "slack"
cask "soulver"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tailscale"
cask "tableplus"
cask "uhk-agent"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
