adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
bash
bash-completion
dbeaver
docker
docker-compose
dropbox
exa
fd
firefox-developer-edition
fzf
git
glances
gnome-shell-extension-dash-to-dock
gvim
htop
jq
libsecret
nodejs
npm
obs-studio
ripgrep
shellcheck
terminator
thunderbird
tldr
tokei
vlc
yarn
